{
  "_name_or_path": "D:/pytorch_uie_ner-main/ernie_3.0_base_zh_pytorch/",
  "architectures": [
    "UIE"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 2048,
  "model_type": "ernie",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "task_id": 0,
  "task_type_vocab_size": 3,
  "torch_dtype": "float32",
  "transformers_version": "4.20.0",
  "type_vocab_size": 4,
  "use_cache": true,
  "use_task_id": true,
  "vocab_size": 40000
}
